ekawahyu/MSP430Ware/driverlib/MSP430FR57xx/comp_d.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
//
// comp_d.c - Driver for the comp_d Module.
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup comp_d_api
//! @{
//
//*****************************************************************************

#include "inc/hw_regaccess.h"
#include "inc/hw_memmap.h"

#ifdef __MSP430_HAS_COMPD__
#include "comp_d.h"

#include <assert.h>

//*****************************************************************************
//
//! \brief DEPRECATED - Initializes the COMP_D Module.
//!
//! Upon successful initialization of the COMP_D module, this function will
//! have reset all necessary register bits and set the given options in the
//! registers. To actually use the COMP_D module, the COMP_D_enable() function
//! must be explicitly called before use. If a Reference Voltage is set to a
//! terminal, the Voltage should be set using the setReferenceVoltage()
//! function.
//!
//! \param baseAddress is the base address of the COMP_D module.
//! \param positiveTerminalInput selects the input to the positive terminal.
//!        Valid values are:
//!        - \b COMP_D_INPUT0 [Default]
//!        - \b COMP_D_INPUT1
//!        - \b COMP_D_INPUT2
//!        - \b COMP_D_INPUT3
//!        - \b COMP_D_INPUT4
//!        - \b COMP_D_INPUT5
//!        - \b COMP_D_INPUT6
//!        - \b COMP_D_INPUT7
//!        - \b COMP_D_INPUT8
//!        - \b COMP_D_INPUT9
//!        - \b COMP_D_INPUT10
//!        - \b COMP_D_INPUT11
//!        - \b COMP_D_INPUT12
//!        - \b COMP_D_INPUT13
//!        - \b COMP_D_INPUT14
//!        - \b COMP_D_INPUT15
//!        - \b COMP_D_VREF
//!        \n Modified bits are \b CDRSEL of \b CDCTL2 register; bits \b CDPDx
//!        of \b CDCTL3 register; bits \b CDIPEN of \b CDCTL0 register.
//! \param negativeTerminalInput selects the input to the negative terminal.
//!        Valid values are:
//!        - \b COMP_D_INPUT0 [Default]
//!        - \b COMP_D_INPUT1
//!        - \b COMP_D_INPUT2
//!        - \b COMP_D_INPUT3
//!        - \b COMP_D_INPUT4
//!        - \b COMP_D_INPUT5
//!        - \b COMP_D_INPUT6
//!        - \b COMP_D_INPUT7
//!        - \b COMP_D_INPUT8
//!        - \b COMP_D_INPUT9
//!        - \b COMP_D_INPUT10
//!        - \b COMP_D_INPUT11
//!        - \b COMP_D_INPUT12
//!        - \b COMP_D_INPUT13
//!        - \b COMP_D_INPUT14
//!        - \b COMP_D_INPUT15
//!        - \b COMP_D_VREF
//!        \n Modified bits are \b CDRSEL of \b CDCTL2 register; bits \b CDPDx
//!        of \b CDCTL3 register; bits \b CDIMEN of \b CDCTL0 register.
//! \param outputFilterEnableAndDelayLevel controls the output filter delay
//!        state, which is either off or enabled with a specified delay level.
//!        This parameter is device specific and delay levels should be found
//!        in the device's datasheet.
//!        Valid values are:
//!        - \b COMP_D_FILTEROUTPUT_OFF [Default]
//!        - \b COMP_D_FILTEROUTPUT_DLYLVL1
//!        - \b COMP_D_FILTEROUTPUT_DLYLVL2
//!        - \b COMP_D_FILTEROUTPUT_DLYLVL3
//!        - \b COMP_D_FILTEROUTPUT_DLYLVL4
//!        \n Modified bits are \b CDFDLY of \b CDCTL1 register.
//! \param invertedOutputPolarity controls if the output will be inverted or
//!        not
//!        Valid values are:
//!        - \b COMP_D_NORMALOUTPUTPOLARITY [Default]
//!        - \b COMP_D_INVERTEDOUTPUTPOLARITY
//!
//! \return STATUS_SUCCESS or STATUS_FAILURE of the initialization process
//
//*****************************************************************************
bool COMP_D_init(uint16_t baseAddress,
                 uint8_t positiveTerminalInput,
                 uint8_t negativeTerminalInput,
                 uint8_t outputFilterEnableAndDelayLevel,
                 uint16_t invertedOutputPolarity)
{
        COMP_D_initializeParam param = { 0 };

        param.positiveTerminalInput = positiveTerminalInput;
        param.negativeTerminalInput = negativeTerminalInput;
        param.outputFilterEnableAndDelayLevel = outputFilterEnableAndDelayLevel;
        param.invertedOutputPolarity = invertedOutputPolarity;

        return COMP_D_initialize(baseAddress, &param);
}

//*****************************************************************************
//
//! \brief Initializes the COMP_D Module.
//!
//! Upon successful initialization of the COMP_D module, this function will
//! have reset all necessary register bits and set the given options in the
//! registers. To actually use the COMP_D module, the COMP_D_enable() function
//! must be explicitly called before use. If a Reference Voltage is set to a
//! terminal, the Voltage should be set using the setReferenceVoltage()
//! function.
//!
//! \param baseAddress is the base address of the COMP_D module.
//! \param param is the pointer to struct for initialization.
//!
//! \return STATUS_SUCCESS or STATUS_FAILURE of the initialization process
//
//*****************************************************************************
bool COMP_D_initialize(uint16_t baseAddress, COMP_D_initializeParam *param)
{
        assert(param != 0);
        assert(param->positiveTerminalInput <= COMP_D_VREF);
        assert(param->negativeTerminalInput <= COMP_D_VREF);
        assert(param->positiveTerminalInput != param->negativeTerminalInput);
        assert(param->outputFilterEnableAndDelayLevel <= COMP_D_FILTEROUTPUT_DLYLVL4);

        bool retVal = STATUS_SUCCESS;

        //Reset COMPD Control 1 & Interrupt Registers for initialization (OFS_CDCTL3
        //is not reset because it controls the input buffers of the analog signals
        //and may cause parasitic effects if an analog signal is still attached and
        //the buffer is re-enabled
        HWREG16(baseAddress + OFS_CDCTL0) &= 0x0000;
        HWREG16(baseAddress + OFS_CDINT)  &= 0x0000;

